%CFA2.2
function  value  = MF3(degree )
degree = 90 - degree;
% degree指的是高度角 （入射角（天顶距） = 90 - 高度角）//
rad = degree * pi / 180;

% 这里取参数：
P = 1000;%1000Pa
e = 0;%0Pa
T = 293.15;%293.15K
beta = 6.5;%6.5K/km
H = 11.231;%11.231km



para1 = -0.009;%c
para2 = 0.001144*(1+0.1164*1e-4*(P-1000)+0.2795*1e-3*e+...
    0.3109*1e-2*(T-293.15)+0.03038*0.1*(-beta+6.5)-0.01217*0.1*(H-11.231));%b
para3 = 0.001185 * (1+0.6071*1e-4*(P-1000)-0.1471*1e-3*e+...
    0.3072*1e-2*(T-293.15)+0.01965*(-beta+6.5)-0.5645*1e-2*(H-11.231));%a


A = sin(rad) + para1;
B = sin(rad) + para2 / A;
C = sin(rad) + para3 / B;


value = 1 / C;


end

